КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул6/КонтурЛогистика_ТрН_Титул6.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ТрН_Титул6</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЭТРН</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатПУДИнфГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрПУДИнфГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>НаимДокОснДовОргСост</name>
    <comment>Наименование документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокОснДовОргСост</name>
    <comment>Номер документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокОснДовОргСост</name>
    <comment>Дата документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведДокОснДовОргСост</name>
    <comment>Доп. сведения документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтороныСостДокОснДовОргСост</name>
    <comment>Стороны составители документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСостДокОснДовОргСост</name>
    <comment>Доп. составитель документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдДокОснДовОргСост</name>
    <comment>Идентификатор документа-основания, по которому экономический субъект является составителем файла обмена первичного учетного документа о факте хозяйственной жизни (информации грузоотправителя)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатПодп</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлПУДИнфПрв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлПУДИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлПУДИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <comment>ОКПО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурноеПодразделение</name>
    <comment>Структурное подразделение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокИспользованияФайлаОбмена</name>
    <comment>Дополнительная информация, позволяющая в автоматизированном режиме определять необходимый для конкретного случая порядок использования информации файла обмена у грузоотправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <comment>Номер банковского счета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанка</name>
    <comment>Наименование банка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БИК</name>
    <comment>Банковский идентификационный код (БИК)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <comment>Корреспондентский счет банка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПлательщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаимДокОснИнПлат</name>
    <comment>Наименование документа-основание, по которому ¶денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокОснИнПлат</name>
    <comment>Номер документаоснование, по которому денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокОснИнПлат</name>
    <comment>Дата документа-основание, по которому денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведДокОснИнПлат</name>
    <comment>Доп. сведения документа-основание, по которому ¶денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтороныСостДокОснИнПлат</name>
    <comment>Стороны составители документа-основание, по которому ¶денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСостДокОснИнПлат</name>
    <comment>Доп. составитель документа-основание, по которому ¶денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдДокОснИнПлат</name>
    <comment>Идентификатор документа-основание, по которому денежные средства будут поступать в оплату перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <comment>Причина отказа в подписи</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <comment>Флаг отказа в подписи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтметкиИнфПол</name>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстИнфИдентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстИнфЗначение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтавкиНДС/КонтурЛогистика_СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10/110</comment>
  </enumValues>
  <enumValues>
    <name>НДС16_67</name>
    <comment>Ставка НДС 16,67%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_03</name>
    <comment>Ставка НДС 18,03%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20/120</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>Ставка НДС 22%</comment>
  </enumValues>
  <enumValues>
    <name>НДС22_122</name>
    <comment>Расчетная ставка НДС 22/122</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Ставка НДС 5%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5_105</name>
    <comment>Расчетная ставка НДС 5/105</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Ставка НДС 7%</comment>
  </enumValues>
  <enumValues>
    <name>НДС7_107</name>
    <comment>Расчетная ставка НДС 7/107</comment>
  </enumValues>
  <enumValues>
    <name>НДС9_09</name>
    <comment>Ставка НДС 9,09%</comment>
  </enumValues>
  <enumValues>
    <name>НДСИсчисляетсяНалоговымАгентом</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул6/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбновитьДанныеФормы();

	Элементы.ДокументОснование.Доступность = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ТипыДокументаОснованияНастроеныДляТитула(6);
	
	ЭлементыДляРазрешенияРедактирования = Новый Массив;
	ЭлементыДляРазрешенияРедактирования.Добавить("Группа2");
	ЭлементыДляРазрешенияРедактирования.Добавить("ГруппаПодписьПеревозчика");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ЭлементыДляРазрешенияРедактирования);
	
	ТумблерЗаполненИД 		= ЗначениеЗаполнено(Объект.ИдДокОснДовОргСост);
	ТумблерЗаполненИДПлат 	= ЗначениеЗаполнено(Объект.ИдДокОснИнПлат);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ПроверитьДокумент();
	ПоказатьСкрытьГруппы(ЭтаФорма);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// ОбновитьДанныеФормы();
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	ПроверитьДокумент();
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.ДокументЭТРН, Истина);
	
	ПерешелВЛогистическиеСтатус = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена;
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	Элементы.ТекущийСтатусДокументооборота.Видимость = ПерешелВЛогистическиеСтатус;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Повторно подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование ,Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена Тогда
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
		ТолькоПросмотр = Ложь;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
		ТолькоПросмотр = Истина;
	КонецЕсли;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	
	Титул1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, Объект.ДокументЭТРН);
	Титул2 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2, Объект.ДокументЭТРН);
	Титул3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3, Объект.ДокументЭТРН);
	Титул4 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4, Объект.ДокументЭТРН);
	Титул5 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5, Объект.ДокументЭТРН);
	
	Титул8ЗаменаВодителя = Документы.КонтурЛогистика_ТрН_Титул8.ПоследняяЗамена(Объект.ДокументЭТРН, "НовыеВодители");
	
	Если ЗначениеЗаполнено(Титул8ЗаменаВодителя) Тогда 
		ВодительНаВыгрузке = Титул8ЗаменаВодителя.НовыеВодители[0].Водитель;
	Иначе
		ВодительНаВыгрузке = Титул1.Водитель;
	КонецЕсли;
	
	СтавкаРавнаБезНДС = Титул5.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.БезНДС")
						Или Титул5.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС0");
	
	ПрицепВЭТрНеУказан = ЗначениеЗаполнено(Объект.ДокументЭТРН.Прицеп);
	Прицеп2ВЭТрНеУказан = ЗначениеЗаполнено(Объект.ДокументЭТРН.Прицеп2);
	
	ВсеПереадресации = Документы.КонтурЛогистика_ТрН_Титул7.ВсеПереадресации(Объект.ДокументЭТРН);
	ПерадресацииИВозвраты.Загрузить(ВсеПереадресации);
	
	ВсеЗамены = Документы.КонтурЛогистика_ТрН_Титул8.ВсеЗамены(Объект.ДокументЭТРН);
	ЗаменаВодителейТС.Загрузить(ВсеЗамены);
	
	Для Каждого Замена Из ЗаменаВодителейТС Цикл 
		Замена.ЕстьЗаменаВодителя 	= Замена.Ссылка.НовыеВодители.Количество();
		Замена.ЕстьЗаменаТС 		= Замена.Ссылка.НовыеТранспортныеСредства.Количество();
		Замена.ЕстьЗаменаПрицепа 	= Замена.Ссылка.НовыеПрицепы.Количество();
	КонецЦикла;
	
	ВсеОтметки = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ВсеОтметкиПоЭТрН(Объект.ДокументЭТРН);
	Отметки.Загрузить(ВсеОтметки);
	
	ВсеАкты = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ВсеАктыПоЭТрН(Объект.ДокументЭТРН);
	Акты.Загрузить(ВсеАкты);
	
	ВсеШтрафы = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ВсеШтрафыПоЭТрН(Объект.ДокументЭТРН);
	Штрафы.Загрузить(ВсеШтрафы);
	
	ДатаПрибытияПогрПВ 	= ?(ЗначениеЗаполнено(Титул2.ЗамДатВрПриб), Титул2.ЗамДатВрПриб, "не указал");
	ДатаПостПогрПВ 		= ?(ЗначениеЗаполнено(Титул2.ЗамДатВрПосПрием), Титул2.ЗамДатВрПосПрием, "не указал");
	ДатаУбытияПогрПВ 	= ?(ЗначениеЗаполнено(Титул2.ЗамДатВрУбыт), Титул2.ЗамДатВрУбыт, "не указал");
	
	ДатаПрибытияВыгрПВ 	= ?(ЗначениеЗаполнено(Титул4.ЗамДатВрПриб), Титул4.ЗамДатВрПриб, "не указал");
	ДатаПостВыгрПВ 		= ?(ЗначениеЗаполнено(Титул4.ЗамДатВрПосВыгр), Титул4.ЗамДатВрПосВыгр, "не указал");
	ДатаУбытияВыгрПВ 	= ?(ЗначениеЗаполнено(Титул4.ЗамДатВрУбыт), Титул4.ЗамДатВрУбыт, "не указал");
		
	ДатыПрибытияНаПогрОтличаются 	= ЗначениеЗаполнено(ДатаПрибытияПогрПВ) И ДатаПрибытияПогрПВ <> "не указал" И Титул1.ДатаВремяПрибытия <> ДатаПрибытияПогрПВ;
	ДатыПрибытияНаВыгрОтличаются 	= ЗначениеЗаполнено(ДатаПрибытияВыгрПВ) И ДатаПрибытияВыгрПВ <> "не указал" И Титул3.ФДатВрПриб <> ДатаПрибытияВыгрПВ;
	ДатыУбытияНаПогрОтличаются 		= ЗначениеЗаполнено(ДатаУбытияПогрПВ) И ДатаУбытияПогрПВ <> "не указал" И Титул1.ДатаВремяУбытия <> ДатаУбытияПогрПВ;
	ДатыУбытияНаВыгрОтличаются 		= ЗначениеЗаполнено(ДатаУбытияВыгрПВ) И ДатаУбытияВыгрПВ <> "не указал" И Титул3.ФДатВрУбыт <> ДатаУбытияВыгрПВ;
	
	ЗамечанияВодителяНаПогр = Титул2.ЗамечанияВодителя;
	ЗамечанияВодителяНаВыгр = Титул4.ЗамечанияВодителя;
	
	ЗамечанияПеревозчикаНаПогр = КонтурЛогистика_ПечатьСервер.ОписаниеЗамечанийПеревозчика(Титул2,, Истина);
	ЗамечанияПеревозчикаНаВыгр = КонтурЛогистика_ПечатьСервер.ОписаниеЗамечанийПеревозчика(Титул4, Истина, Истина);
	
	ЭтоЭкспедиция = Объект.ДокументЭТрН.ЭтоЭкспедиция;
	
	// установка заголовков страниц
	
	ЕстьРасхожденияПоМассе 		= Не Титул1.МассаБруттоКг = Титул3.МассаБруттоКг;
	ЕстьРасхожденияПоКоличеству = Не Титул1.КоличествоМест = Титул3.КоличествоМестПринято;
	
	Элементы.ГруппаТоварыИзТ1.Заголовок 			= "Грузы при оформлении (" + Титул1.Товары.Количество() + ")";	
	Элементы.ГруппаТоварыИзТ3.Заголовок 			= "Грузы на приемке (" + Титул3.Товары.Количество() + ")";
	Элементы.СтраницаПереадресации.Заголовок 		= "Переадресации и возвраты (" + ПерадресацииИВозвраты.Количество() + ")";
	Элементы.СтраницаЗаменыВодителейТС.Заголовок 	= "Замены водителей | ТС (" + ЗаменаВодителейТС.Количество() + ")";
	Элементы.СтраницаОтметки.Заголовок 				= "Отметки, Акты, Штрафы (" + Отметки.Количество() + ")";
	
	// заголовок Т3
	
	Элементы.ГруппаТоварыИзТ3.Картинка = БиблиотекаКартинок.КонтурЛогистика_Коробка;
	
	Если ЕстьРасхожденияПоКоличеству Или ЕстьРасхожденияПоМассе Тогда 
		
		Элементы.ГруппаТоварыИзТ3.Картинка = БиблиотекаКартинок.КонтурЛогистика_ВосклицаниеКрасное;
		
		Если ЕстьРасхожденияПоКоличеству И ЕстьРасхожденияПоМассе Тогда 
			Элементы.ГруппаТоварыИзТ3.Заголовок = "Грузы на приемке (" + Титул3.Товары.Количество() + ", есть расхождения по количеству и массе)";
		ИначеЕсли ЕстьРасхожденияПоКоличеству Тогда 
			Элементы.ГруппаТоварыИзТ3.Заголовок = "Грузы на приемке (" + Титул3.Товары.Количество() + ", есть расхождения по количеству)";
		Иначе	
			Элементы.ГруппаТоварыИзТ3.Заголовок = "Грузы на приемке (" + Титул3.Товары.Количество() + ", есть расхождения по массе)";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи.Видимость = Не ТолькоПросмотр;
	КонецЕсли;
	
	СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы.Видимость = СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюИДоступностью(Форма)
	
	Элементы 	= Форма.Элементы;
	Объект 		= Форма.Объект;
	
	ЭтоВходящий 			= Форма.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен");
	ЭтоЧерновик 			= Форма.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
	ЭтоИсправлениеОшибки 	= Форма.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка");
	
	Элементы.ГруппаПодписьПеревозчика.Видимость = ЗначениеЗаполнено(Объект.Фамилия);
	
	Элементы.ИдДок.Видимость 			= Форма.ТумблерЗаполненИД;
	Элементы.ГруппаДокумент.Видимость 	= Не Форма.ТумблерЗаполненИД;
	
	
	Элементы.ИдДокПлат.Видимость 			= Форма.ТумблерЗаполненИДПлат;
	Элементы.ГруппаДокументПлат.Видимость 	= Не Форма.ТумблерЗаполненИДПлат;
	
	
	// причина отказа в подписи 
	
	Элементы.ГруппаПричинаОтказаВПодписи.Видимость = (ЭтоВходящий Или Не ЭтоЧерновик) И Объект.ЕстьОтказВПодписи;
	Элементы.НомерСчета.Видимость 	= Не Объект.ЕстьОтказВПодписи;
	Элементы.ГруппаДанныеДопПоля.Видимость 	= Не Объект.ЕстьОтказВПодписи;
	
	Элементы.ГруппаПрицеп.Видимость = Форма.ПрицепВЭТрНеУказан;
	Элементы.ГруппаПрицеп2.Видимость = Форма.Прицеп2ВЭТрНеУказан;
	Элементы.ГруппаЭкспедиция.Видимость = Форма.ЭтоЭкспедиция;
	
	Элементы.СтраницаОтметки.Видимость 				= ЗначениеЗаполнено(Форма.Отметки); 
	Элементы.СтраницаПереадресации.Видимость 		= ЗначениеЗаполнено(Форма.ПерадресацииИВозвраты);
	Элементы.СтраницаЗаменыВодителейТС.Видимость 	= ЗначениеЗаполнено(Форма.ЗаменаВодителейТС);
			
	Элементы.ЗамечанияВодителяВыгр.Видимость 	= ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаВыгр);
	Элементы.БезЗамечВодитВыгр.Видимость 		= Не ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаВыгр);
	Элементы.ЗамечанияПеревозчикаВыгр.Видимость = ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаВыгр);
	Элементы.БезЗамечПВВыгр.Видимость 			= Не ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаВыгр);
	
	Элементы.Титул5СуммаНДС.Видимость 		= Не Форма.СтавкаРавнаБезНДС;
	Элементы.Титул5СтоимостьСНДС.Видимость 	= Не Форма.СтавкаРавнаБезНДС;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьСкрытьГруппы(Форма)
	
	Элементы 	= Форма.Элементы;
	
	// поведение группы "Погрузка"
		
	Если Форма.ДатыПрибытияНаПогрОтличаются Или Форма.ДатыУбытияНаПогрОтличаются Тогда
		Элементы.ГруппаПогрузка.Заголовок 						= "Даты и время";
		Элементы.ГруппаПогрузка.ЗаголовокСвернутогоОтображения 	= "Даты и время - есть расхождения";
		
		Элементы.ВосклицаниеДатыПогр.Видимость = Истина;
		Элементы.ГруппаПогрузка.Показать();
	Иначе
		Элементы.ГруппаПогрузка.Заголовок 						= "Даты и время";
		Элементы.ГруппаПогрузка.ЗаголовокСвернутогоОтображения 	= "Даты и время - расхождений нет";
		
		Элементы.ВосклицаниеДатыПогр.Видимость = Ложь;
		Элементы.ГруппаПогрузка.Скрыть();
	КонецЕсли;
	
	// поведение группы "Выгрузка"
	
	Если Форма.ДатыПрибытияНаВыгрОтличаются Или Форма.ДатыУбытияНаВыгрОтличаются Тогда
		Элементы.ГруппаВыгрузка.Заголовок 						= "Даты и время";
		Элементы.ГруппаВыгрузка.ЗаголовокСвернутогоОтображения 	= "Даты и время - есть расхождения";
		
		Элементы.ВосклицаниеДатыРазг.Видимость = Истина;
		Элементы.ГруппаВыгрузка.Показать();
	Иначе
		Элементы.ГруппаВыгрузка.Заголовок 						= "Даты и время";
		Элементы.ГруппаВыгрузка.ЗаголовокСвернутогоОтображения 	= "Даты и время - расхождений нет";
		
		Элементы.ВосклицаниеДатыРазг.Видимость = Ложь;
		Элементы.ГруппаВыгрузка.Скрыть();
	КонецЕсли;
	
	// поведение группы "ГруппаВодительНаПогрузке"
	
	Если ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаПогр) Или ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаПогр) Тогда
		Элементы.ГруппаВодительНаПогрузке.Заголовок 						= "Водитель и замечания";
		Элементы.ГруппаВодительНаПогрузке.ЗаголовокСвернутогоОтображения 	= "Водитель и замечания - есть замечания";
		
		Элементы.ВосклицаниеЗамечанияПогр.Видимость = Истина;
		Элементы.ГруппаВодительНаПогрузке.Показать();
	Иначе
		Элементы.ГруппаВодительНаПогрузке.Заголовок 						= "Водитель и замечания";
		Элементы.ГруппаВодительНаПогрузке.ЗаголовокСвернутогоОтображения 	= "Водитель и замечания - замечаний нет";
		
		Элементы.ВосклицаниеЗамечанияПогр.Видимость = Ложь;
		Элементы.ГруппаВодительНаПогрузке.Скрыть();
	КонецЕсли;	
	
	Элементы.ЗамечанияВодителяПогр.Видимость 	= ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаПогр);
	Элементы.БезЗамечВодитПогр.Видимость 		= Не ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаПогр);
	Элементы.ЗамечанияПеревозчикаПогр.Видимость = ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаПогр);
	Элементы.БезЗамечПВПогр.Видимость 			= Не ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаПогр);
	
	// поведение группы "ГруппаВодителяНаВыгрузке"
	
	Если ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаВыгр) Или ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаВыгр) Тогда
		Элементы.ГруппаВодителяНаВыгрузке.Заголовок 						= "Водитель и замечания";
		Элементы.ГруппаВодителяНаВыгрузке.ЗаголовокСвернутогоОтображения 	= "Водитель и замечания - есть замечания";
		
		Элементы.ВосклицаниеЗамечанияРазг.Видимость = Истина;
		Элементы.ГруппаВодителяНаВыгрузке.Показать();
	Иначе
		Элементы.ГруппаВодителяНаВыгрузке.Заголовок 						= "Водитель и замечания";
		Элементы.ГруппаВодителяНаВыгрузке.ЗаголовокСвернутогоОтображения 	= "Водитель и замечания - замечаний нет";
		
		Элементы.ВосклицаниеЗамечанияРазг.Видимость = Ложь;
		Элементы.ГруппаВодителяНаВыгрузке.Скрыть();
	КонецЕсли;

	
КонецПроцедуры	

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
	УправлениеВидимостьюИДоступностью(ЭтаФорма);
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ТрН_Титул6.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура СвернутьШапку(Команда)

	ШапкаНаОтдельнойЗакладке = Истина;
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьШапку(Команда)

	ШапкаНаОтдельнойЗакладке = Ложь;
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеШапки()

	Если ШапкаНаОтдельнойЗакладке Тогда

		текАктивнаяЗакладка = Элементы.Страницы.ТекущаяСтраница;

		ПереместитьШапкуВызовСервера();
		Элементы.СвернутьШапку.Видимость = Ложь;
		Элементы.РазвернутьШапку.Видимость = Истина;

		ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
		Если Не ПанельОшибокРазвернута Тогда
			ПанельОшибокСвернутьРазвернутьВызовОМ();
		КонецЕсли;

		Элементы.Страницы.ТекущаяСтраница = текАктивнаяЗакладка;

	Иначе

		ПереместитьШапкуВызовСервера();
		Элементы.СвернутьШапку.Видимость = Истина;
		Элементы.РазвернутьШапку.Видимость = Ложь;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПереместитьШапкуВызовСервера()

	Если ШапкаНаОтдельнойЗакладке Тогда
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма,
															   Элементы.ГруппаШапкаДанные,
															   Элементы.СтраницаШапка);
	Иначе
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма,
															   Элементы.ГруппаШапкаДанные,
															   Элементы.ГруппаШапкаМестоположение);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()

	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры


// Обслуживание панели ошибок

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Функция ОчиститьДанныеДокумента(ОбъектДокумента, ПостФикс = "") 
	
	ОбъектДокумента["ИдДок" + ПостФикс] = "";
	ОбъектДокумента["НаимДок" + ПостФикс] = "";
	ОбъектДокумента["НомерДок" + ПостФикс] = "";
	ОбъектДокумента["ДатаДок" + ПостФикс] = "";
	ОбъектДокумента["ДопСведДок" + ПостФикс] = "";
	ОбъектДокумента["СтороныСостДок" + ПостФикс] = "";
	ОбъектДокумента["ДопСостДок" + ПостФикс] = "";
		
КонецФункции

&НаКлиенте
Процедура ТумблерЗаполненИД(Элемент)
	
	ОчиститьДанныеДокумента(Объект, "ОснДовОргСост");
			
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТумблерЗаполненИДПлат(Элемент)
	
	ОчиститьДанныеДокумента(Объект, "ОснИнПлат");
			
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура БИКПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ИдДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура НаимДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура НомерДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СтороныСостПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДопСостПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДопСведПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПлательщикаПриИзменении(Элемент)
	
	ОчиститьДанныеДокумента(Объект, "ОснИнПлат");
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		
		Элементы.Акты.ОтборСтрок 			= Неопределено;
		Элементы.Штрафы.ОтборСтрок 			= Неопределено;
		
	Иначе
		
		Элементы.Акты.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		Элементы.Штрафы.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерадресацииИВозвратыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПерадресацииИВозвратыСсылка" Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.Ссылка);
	ИначеЕсли Поле.Имя = "ПерадресацииИВозвратыГрузополучатель" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.Грузополучатель);
	ИначеЕсли Поле.Имя = "ПерадресацииИВозвратыМестоПрибытия" Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.МестоДоставки);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаВодителейТСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ЗаменаВодителейТССсылка" Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитов(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.РазрешитьРедактированиеРеквизитов(ЭтаФорма);
	
КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции
